[6165_IT_2024-05-01.txt](https://github.com/DataBiosphere/azul/files/15182004/6165_IT_2024-05-01.txt)

```
Terraform will perform the following actions:

  # aws_cloudfront_distribution.browser will be updated in-place
  ~ resource "aws_cloudfront_distribution" "browser" {
        id                             = "E3JAUIVOC72EMP"
        tags                           = {
            "Name"                = "azul-browser"
            "billing"             = "anvil"
            "component"           = "azul-browser"
            "deployment"          = "anvildev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "browser"
        }
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
          + response_headers_policy_id = (known after apply)
            # (12 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # aws_cloudfront_function.add_response_headers will be updated in-place
  ~ resource "aws_cloudfront_function" "add_response_headers" {
      ~ code            = <<-EOT
            function handler(event) {
                var response = event.response;
                var headers = response.headers;
                var request = event.request;
                var uri = request.uri;

                // Set HTTP security headers
                // Since JavaScript doesn't allow for hyphens in variable names, we use the dict["key"] notation
          -     headers['strict-transport-security'] = { value: 'max-age=63072000; includeSubdomains; preload'};
          -     // headers['content-security-policy'] = { value: "default-src 'none'; img-src 'self'; script-src 'self'; style-src 'self'; object-src 'none'"};
          -     // headers['x-content-type-options'] = { value: 'nosniff'};
          -     // headers['x-frame-options'] = {value: 'DENY'};
          -     // headers['x-xss-protection'] = {value: '1; mode=block'};

                // Set cache control header …
                if (uri.startsWith('/_next/static/')) {
                    // … for files in _next/static (versioned assets like JS, CSS)
                    headers['cache-control'] = { value: 'public, max-age=31536000, immutable' };
                } else if (uri.startsWith('/api/')) {
                    // … for API routes
                    headers['cache-control'] = { value: 'no-store' };
                } else if (
                    uri.startsWith('/static/')
                    || uri.match(/\.(jpg|jpeg|png|svg|webp|gif|css|js)$/)
                ) {
                    // … for images and other static assets
                    headers['cache-control'] = { value: 'public, max-age=86400' };
                } else {
                    // … for HTML pages and all other content
                    headers['cache-control'] = { value: 'public, max-age=0, must-revalidate' };
                }

                // Return the response to viewers
                return response;
            }
        EOT
        id              = "azul-add_response_headers-anvildev"
        name            = "azul-add_response_headers-anvildev"
        # (6 unchanged attributes hidden)
    }

  # aws_cloudfront_response_headers_policy.browser will be created
  + resource "aws_cloudfront_response_headers_policy" "browser" {
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "browser"

      + security_headers_config {
          + content_security_policy {
              + content_security_policy = "default-src 'self';object-src 'none';frame-src 'none';frame-ancestors 'none';child-src 'none';img-src 'self' data: https://lh3.googleusercontent.com https://www.google-analytics.com https://www.googletagmanager.com;script-src 'self' 'unsafe-inline' 'unsafe-eval' https://accounts.google.com/gsi/client https://www.google-analytics.com https://www.googletagmanager.com;style-src 'self' 'unsafe-inline' https://fonts.googleapis.com https://p.typekit.net https://use.typekit.net;font-src 'self' data: https://fonts.gstatic.com https://use.typekit.net/af/;connect-src 'self' https://www.google-analytics.com https://www.googleapis.com/oauth2/v3/userinfo https://www.googletagmanager.com https://support.terra.bio/api/v2/ https://sam.dsde-dev.broadinstitute.org/register/user/v1 https://sam.dsde-dev.broadinstitute.org/register/user/v2/self/termsOfServiceDetails https://firecloud-orchestration.dsde-dev.broadinstitute.org/api/nih/status https://service.anvil.gi.ucsc.edu"
              + override                = true
            }
          + content_type_options {
              + override = true
            }
          + frame_options {
              + frame_option = "DENY"
              + override     = false
            }
          + referrer_policy {
              + override        = false
              + referrer_policy = "strict-origin-when-cross-origin"
            }
          + strict_transport_security {
              + access_control_max_age_sec = 63072000
              + include_subdomains         = true
              + override                   = false
              + preload                    = true
            }
          + xss_protection {
              + mode_block = true
              + override   = false
              + protection = true
            }
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```